<h1 style='background:lightgreen ; color: black '><center>Rivision DAY 8</center></h1>

In [1]:
import pandas as pd
import seaborn as sns
import numpy as np
import matplotlib.pyplot

In [2]:
#version checking
pd.__version__

'2.2.3'

<center style='background:orange'><h2 style='color:black'> Creating a dataframe</h2> </center>

In [3]:
#creating a dataframe
df2  = pd.DataFrame({
    'WEEK-1':['Maths-9','Maths 10',"Pandas","CPP"],
    'WEEK-2':['Maths-9','Maths 10',"Pandas","CPP"],
    'WEEK-3':['Maths-11','Maths-12',"Pandas","CPP"],
    'WEEK-4':['Maths-11','Maths-12',"Pandas","CPP"],
    "WEEK-5":
        ['Maths-11','Maths-12',"Pandas",'CPP']
                     })

In [4]:
df2

     WEEK-1    WEEK-2    WEEK-3    WEEK-4    WEEK-5
0   Maths-9   Maths-9  Maths-11  Maths-11  Maths-11
1  Maths 10  Maths 10  Maths-12  Maths-12  Maths-12
2    Pandas    Pandas    Pandas    Pandas    Pandas
3       CPP       CPP       CPP       CPP       CPP

Creating an array using the numpy

In [5]:
df3 = np.array([[1,2,3,4,5,6,7],[11,22,33,44,55,66,77],[111,222,333,444,555,666,777],[12,23,34,45,56,67,78],[87,76,65,54,43,32,21,]])
pd.DataFrame(df3)

     0    1    2    3    4    5    6
0    1    2    3    4    5    6    7
1   11   22   33   44   55   66   77
2  111  222  333  444  555  666  777
3   12   23   34   45   56   67   78
4   87   76   65   54   43   32   21

### Crating a random array

In [6]:
df4=pd.DataFrame(np.random.rand(10,5),columns=list('ABCDE'))
df4

          A         B         C         D         E
0  0.414462  0.820841  0.247023  0.724786  0.935838
1  0.998653  0.637841  0.839417  0.729892  0.154444
2  0.593163  0.043990  0.570299  0.408119  0.651512
3  0.410729  0.007461  0.161349  0.009336  0.470318
4  0.402722  0.315227  0.253041  0.474323  0.570928
5  0.012906  0.917641  0.637362  0.950841  0.059380
6  0.677850  0.569506  0.061971  0.004986  0.870307
7  0.181655  0.744396  0.334143  0.831701  0.973954
8  0.005789  0.345753  0.760692  0.272247  0.973313
9  0.223174  0.741800  0.600402  0.149122  0.246344

renaming the df4 columnn

In [7]:
df4 = df4.rename(columns={
    "A":"col_1",
    "B":"col_2",
    "C":"col_3",
    "D":"col_4",
    "E":"col_5"
})

In [8]:
df4

      col_1     col_2     col_3     col_4     col_5
0  0.414462  0.820841  0.247023  0.724786  0.935838
1  0.998653  0.637841  0.839417  0.729892  0.154444
2  0.593163  0.043990  0.570299  0.408119  0.651512
3  0.410729  0.007461  0.161349  0.009336  0.470318
4  0.402722  0.315227  0.253041  0.474323  0.570928
5  0.012906  0.917641  0.637362  0.950841  0.059380
6  0.677850  0.569506  0.061971  0.004986  0.870307
7  0.181655  0.744396  0.334143  0.831701  0.973954
8  0.005789  0.345753  0.760692  0.272247  0.973313
9  0.223174  0.741800  0.600402  0.149122  0.246344

Changing any character in column name

In [9]:
df4.columns=df4.columns.str.replace('_',' ')
df4

      col 1     col 2     col 3     col 4     col 5
0  0.414462  0.820841  0.247023  0.724786  0.935838
1  0.998653  0.637841  0.839417  0.729892  0.154444
2  0.593163  0.043990  0.570299  0.408119  0.651512
3  0.410729  0.007461  0.161349  0.009336  0.470318
4  0.402722  0.315227  0.253041  0.474323  0.570928
5  0.012906  0.917641  0.637362  0.950841  0.059380
6  0.677850  0.569506  0.061971  0.004986  0.870307
7  0.181655  0.744396  0.334143  0.831701  0.973954
8  0.005789  0.345753  0.760692  0.272247  0.973313
9  0.223174  0.741800  0.600402  0.149122  0.246344

ADDing a prefix

In [10]:
df4 = df4.add_prefix('c_')
df4

    c_col 1   c_col 2   c_col 3   c_col 4   c_col 5
0  0.414462  0.820841  0.247023  0.724786  0.935838
1  0.998653  0.637841  0.839417  0.729892  0.154444
2  0.593163  0.043990  0.570299  0.408119  0.651512
3  0.410729  0.007461  0.161349  0.009336  0.470318
4  0.402722  0.315227  0.253041  0.474323  0.570928
5  0.012906  0.917641  0.637362  0.950841  0.059380
6  0.677850  0.569506  0.061971  0.004986  0.870307
7  0.181655  0.744396  0.334143  0.831701  0.973954
8  0.005789  0.345753  0.760692  0.272247  0.973313
9  0.223174  0.741800  0.600402  0.149122  0.246344

### spliting the dataset into 2

In [11]:
df4a=df4.sample(frac=0.5, random_state=1)

checking the half dataset

In [12]:
df4a

    c_col 1   c_col 2   c_col 3   c_col 4   c_col 5
2  0.593163  0.043990  0.570299  0.408119  0.651512
9  0.223174  0.741800  0.600402  0.149122  0.246344
6  0.677850  0.569506  0.061971  0.004986  0.870307
4  0.402722  0.315227  0.253041  0.474323  0.570928
0  0.414462  0.820841  0.247023  0.724786  0.935838

making the other half a dataset

In [13]:
df4b= df4.drop(df4a.index)

checking

In [14]:
df4b

    c_col 1   c_col 2   c_col 3   c_col 4   c_col 5
1  0.998653  0.637841  0.839417  0.729892  0.154444
3  0.410729  0.007461  0.161349  0.009336  0.470318
5  0.012906  0.917641  0.637362  0.950841  0.059380
7  0.181655  0.744396  0.334143  0.831701  0.973954
8  0.005789  0.345753  0.760692  0.272247  0.973313

In [15]:
print("df4a :",df4a.shape)
print("df4b : ",df4b.shape)

df4a : (5, 5)
df4b :  (5, 5)

### Combining two dataset

In [16]:
df4ab = pd.concat([df4a,df4b],ignore_index=True)

In [17]:
df4ab

    c_col 1   c_col 2   c_col 3   c_col 4   c_col 5
0  0.593163  0.043990  0.570299  0.408119  0.651512
1  0.223174  0.741800  0.600402  0.149122  0.246344
2  0.677850  0.569506  0.061971  0.004986  0.870307
3  0.402722  0.315227  0.253041  0.474323  0.570928
4  0.414462  0.820841  0.247023  0.724786  0.935838
5  0.998653  0.637841  0.839417  0.729892  0.154444
6  0.410729  0.007461  0.161349  0.009336  0.470318
7  0.012906  0.917641  0.637362  0.950841  0.059380
8  0.181655  0.744396  0.334143  0.831701  0.973954
9  0.005789  0.345753  0.760692  0.272247  0.973313

<center style='background:lightgreen; color:black'><h2>Filtering a Dataset</h2></center>

filtering a columns by a unique value of that columns

In [18]:
df =sns.load_dataset("titanic")
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [49]:
df[(df.sex=="male")]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,Age2,surviva;
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,young,Akher_mout
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,adults,Akher_mout
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True,NaN,Akher_mout
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True,adults,Akher_mout
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False,childerns,Akher_mout
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
883,0,2,male,28.0,0,0,10.5000,S,Second,man,True,NaN,Southampton,no,True,adults,Akher_mout
884,0,3,male,25.0,0,0,7.0500,S,Third,man,True,NaN,Southampton,no,True,young,Akher_mout
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,adults,Akher_mout
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,adults,life is shit
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,adults,Akher_mout

total unique values count

In [20]:
df.sex.value_counts()

sex
male      577
female    314
Name: count, dtype: int64

In [41]:
df["class"].value_counts(
)

class
Third     491
First     216
Second    184
Name: count, dtype: int64

checking the largest count nlargest\
#this will tell us about the most used unique vaulue \
-> if you put some values in the parameter e.g (4)\
-> it will print the top 4 most used unique values

In [21]:
df.fare.value_counts().nlargest(4)

fare
8.0500     43
13.0000    42
7.8958     38
7.7500     34
Name: count, dtype: int64

## working with groupby

In [22]:
df.groupby(['sex','survived']).count()

                 pclass  age  sibsp  parch  fare  embarked  class  who  \
sex    survived
female 0             81   64     81     81    81        81     81   81
       1            233  197    233    233   233       231    233  233
male   0            468  360    468    468   468       468    468  468
       1            109   93    109    109   109       109    109  109

                 adult_male  deck  embark_town  alive  alone
sex    survived
female 0                 81     6           81     81     81
       1                233    91          231    233    233
male   0                468    61          468    468    468
       1                109    45          109    109    109

In [50]:
df[(df.sex=="male")].count()

survived       577
pclass         577
sex            577
age            453
sibsp          577
parch          577
fare           577
embarked       577
class          577
who            577
adult_male     577
deck           106
embark_town    577
alive          577
alone          577
Age2           453
surviva;       577
dtype: int64

so overall mens were  577 on the ship

In [51]:
df['embark_town'].value_counts()

embark_town
Southampton    644
Cherbourg      168
Queenstown      77
Name: count, dtype: int64

In [54]:
df.groupby(['sex']).count()

,survived,pclass,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,Age2,surviva;
sex,,,,,,,,,,,,,,,,
female,314,314,261,314,314,314,312,314,314,314,97,312,314,314,261,314
male,577,577,453,577,577,577,577,577,577,577,106,577,577,577,453,577

In [53]:
df.groupby(['sex','embark_town']).count()

                    survived  pclass  age  sibsp  parch  fare  embarked  \
sex    embark_town
female Cherbourg          73      73   61     73     73    73        73
       Queenstown         36      36   12     36     36    36        36
       Southampton       203     203  186    203    203   203       203
male   Cherbourg          95      95   69     95     95    95        95
       Queenstown         41      41   16     41     41    41        41
       Southampton       441     441  368    441    441   441       441

                    class  who  adult_male  deck  alive  alone  Age2  surviva;
sex    embark_town
female Cherbourg       73   73          73    37     73     73    61        73
       Queenstown      36   36          36     2     36     36    12        36
       Southampton    203  203         203    56    203    203   186       203
male   Cherbourg       95   95          95    32     95     95    69        95
       Queenstown      41   41          41     2     41     41    16        41
       Southampton    441  441         441    72    441    441   368       441

In [52]:
df.groupby(['sex','embark_town','class']).count()

C:\Users\KHATTAK\AppData\Local\Temp\ipykernel_7532\1714229927.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df.groupby(['sex','embark_town','class']).count()

                           survived  pclass  age  sibsp  parch  fare  \
sex    embark_town class
female Cherbourg   First         43      43   38     43     43    43
                   Second         7       7    7      7      7     7
                   Third         23      23   16     23     23    23
       Queenstown  First          1       1    1      1      1     1
                   Second         2       2    1      2      2     2
                   Third         33      33   10     33     33    33
       Southampton First         48      48   44     48     48    48
                   Second        67      67   66     67     67    67
                   Third         88      88   76     88     88    88
male   Cherbourg   First         42      42   36     42     42    42
                   Second        10      10    8     10     10    10
                   Third         43      43   25     43     43    43
       Queenstown  First          1       1    1      1      1     1
                   Second         1       1    1      1      1     1
                   Third         39      39   14     39     39    39
       Southampton First         79      79   64     79     79    79
                   Second        97      97   90     97     97    97
                   Third        265     265  214    265    265   265

                           embarked  who  adult_male  deck  alive  alone  \
sex    embark_town class
female Cherbourg   First         43   43          43    35     43     43
                   Second         7    7           7     1      7      7
                   Third         23   23          23     1     23     23
       Queenstown  First          1    1           1     1      1      1
                   Second         2    2           2     1      2      2
                   Third         33   33          33     0     33     33
       Southampton First         48   48          48    43     48     48
                   Second        67   67          67     8     67     67
                   Third         88   88          88     5     88     88
male   Cherbourg   First         42   42          42    31     42     42
                   Second        10   10          10     1     10     10
                   Third         43   43          43     0     43     43
       Queenstown  First          1    1           1     1      1      1
                   Second         1    1           1     0      1      1
                   Third         39   39          39     1     39     39
       Southampton First         79   79          79    62     79     79
                   Second        97   97          97     5     97     97
                   Third        265  265         265     5    265    265

                           Age2  surviva;
sex    embark_town class
female Cherbourg   First     38        43
                   Second     7         7
                   Third     16        23
       Queenstown  First      1         1
                   Second     1         2
                   Third     10        33
       Southampton First     44        48
                   Second    66        67
                   Third     76        88
male   Cherbourg   First     36        42
                   Second     8        10
                   Third     25        43
       Queenstown  First      1         1
                   Second     1         1
                   Third     14        39
       Southampton First     64        79
                   Second    90        97
                   Third    214       265

Selecting a specific row or column using iloc

In [23]:
#selecting some specific rows
df.iloc[0:10]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False

In [24]:
#selecting both row and columns
df.loc[0:10,'survived':'fare']

    survived  pclass     sex   age  sibsp  parch     fare
0          0       3    male  22.0      1      0   7.2500
1          1       1  female  38.0      1      0  71.2833
2          1       3  female  26.0      0      0   7.9250
3          1       1  female  35.0      1      0  53.1000
4          0       3    male  35.0      0      0   8.0500
5          0       3    male   NaN      0      0   8.4583
6          0       1    male  54.0      0      0  51.8625
7          0       3    male   2.0      3      1  21.0750
8          1       3  female  27.0      0      2  11.1333
9          1       2  female  14.0      1      0  30.0708
10         1       3  female   4.0      1      1  16.7000

### Multindex Series Reshape

In [25]:

print(df.survived.mean()*100,"%")

38.38383838383838 %

In [26]:
df.groupby('sex').survived.mean()*100

sex
female    74.203822
male      18.890815
Name: survived, dtype: float64

In [27]:
df.groupby(['sex','class']).survived.mean()*100
#mennnnnnnnnnnnnnnnnnnn

C:\Users\KHATTAK\AppData\Local\Temp\ipykernel_7532\411157082.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df.groupby(['sex','class']).survived.mean()*100

sex     class
female  First     96.808511
        Second    92.105263
        Third     50.000000
male    First     36.885246
        Second    15.740741
        Third     13.544669
Name: survived, dtype: float64

In [28]:
df.groupby(['sex','class']).survived.mean().unstack()*100

C:\Users\KHATTAK\AppData\Local\Temp\ipykernel_7532\831368290.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df.groupby(['sex','class']).survived.mean().unstack()*100

class       First     Second      Third
sex
female  96.808511  92.105263  50.000000
male    36.885246  15.740741  13.544669

### Continous data to categorical

In [29]:
pd.cut(df.age,bins=[0,15,25,99],labels=['childerns','young','adults'])

0       young
1      adults
2      adults
3      adults
4      adults
        ...
886    adults
887     young
888       NaN
889    adults
890    adults
Name: age, Length: 891, dtype: category
Categories (3, object): ['childerns' < 'young' < 'adults']

In [30]:
df['Age2']=pd.cut(df.age,bins=[0,15,25,99],labels=['childerns','young','adults'])

In [31]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,Age2
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,young
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,adults
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,adults
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,adults
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,adults
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,adults
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,young
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,NaN
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,adults
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,adults

### converting one set of value to another

In [32]:
df['surviva;']=df.survived.map({
    0:'Akher_mout',
    1:"life is shit"
    
})

In [33]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,Age2,surviva;
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,young,Akher_mout
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,adults,life is shit
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,adults,life is shit
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,adults,life is shit
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,adults,Akher_mout
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,adults,Akher_mout
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,young,life is shit
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,NaN,Akher_mout
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,adults,life is shit
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,adults,Akher_mout

In [34]:
df.melt(id_vars='sex',var_name="survived")

          sex  survived         value
0        male  survived             0
1      female  survived             1
2      female  survived             1
3      female  survived             1
4        male  survived             0
...       ...       ...           ...
14251    male  surviva;    Akher_mout
14252  female  surviva;  life is shit
14253  female  surviva;    Akher_mout
14254    male  surviva;  life is shit
14255    male  surviva;    Akher_mout

[14256 rows x 3 columns]